app/views/applications/new.html.erb

          <div class="col-sm-offset-2 col-sm-8">
              <%= f.collection_check_boxes :course_ids, Course.all, :id, :checkbox_name do |cb| %>
---
SELECT "courses".* FROM "courses"