app/views/applications/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "course_applications" ON "courses"."id" = "course_applications"."course_id" WHERE "course_applications"."application_id" = ?  [["application_id", 5]]
---
                    <% if course.course_applications %>
                      <% @user_course_application = course.course_applications.where(application_id: @user.application.id).first %>