app/controllers/applications_controller.rb

  def show
    @user = current_user
    @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 5]]

  def new
    @application = Application.new
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def create
    @application = Application.create(application_params)
    @application.user = current_user
    if @application.save
---
INSERT INTO "applications" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-21 14:12:18.347303"], ["updated_at", "2016-04-21 14:12:18.347303"]]
UPDATE "applications" SET "user_id" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["user_id", 15], ["updated_at", "2016-04-21 14:18:51.401621"], ["id", 5]]
UPDATE "users" SET "applied" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["applied", "t"], ["updated_at", "2016-04-21 14:46:44.480913"], ["id", 17]]