app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Technology"], ["created_at", "2016-04-21 13:25:07.464128"], ["updated_at", "2016-04-21 13:25:07.464128"]]
---
    def create
      @category = Category.create(category_params)