app/controllers/colleges_controller.rb

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ?  ORDER BY "colleges"."id" ASC LIMIT 1  [["id", 2]]
---
    def show
      @college = College.find(params[:id])

SELECT "colleges".* FROM "colleges" WHERE (name LIKE '%gla%')  ORDER BY created_at DESC
---
    def index
      @colleges = College.all