app/controllers/colleges_controller.rb

SELECT COUNT(*) FROM "colleges" WHERE (name LIKE '%of%')
---
  def index
    @colleges = College.search(params[:search]).paginate(:page => params[:page], :per_page => 9).order(:name)