app/controllers/courses_controller.rb

  def index
      @courses = Course.all
---
SELECT "courses".* FROM "courses" WHERE (college LIKE'%glasgow')  ORDER BY created_at DESC

  def create
      @course = Course.new(course_params)
      @course.college = current_college
      if @course.save
---
INSERT INTO "courses" ("title", "description", "college_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test Course"], ["description", "Test course"], ["college_id", 2], ["created_at", "2016-04-13 19:36:39.584047"], ["updated_at", "2016-04-13 19:36:39.584047"]]

  def update
      @course = Course.find(params[:id])

      if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "courses" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "Third Course (Edited)"], ["description", "Edited description of third course"], ["updated_at", "2016-04-06 16:24:53.692828"], ["id", 4]]

  def destroy
      @course = Course.find(params[:id])

      @course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 3]]

  def show
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]

  def edit
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]