app/controllers/staffs_controller.rb

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ?  ORDER BY "staffs"."id" ASC LIMIT 1  [["id", 5]]
---
    def show
        @staff = Staff.find(params[:id])