app/views/categories/index.html.erb

                <li>
                    <%= pluralize(category.courses.count, "course") %>
---
SELECT COUNT(*) FROM "courses" INNER JOIN "course_categories" ON "courses"."id" = "course_categories"."course_id" WHERE "course_categories"."category_id" = ?  [["category_id", 1]]