app/views/categories/show.html.erb

              <br>
              <p>Categories: <%= render course.categories if course.categories.any?%></p>
---
SELECT  1 AS one FROM "categories" INNER JOIN "course_categories" ON "categories"."id" = "course_categories"."category_id" WHERE "course_categories"."course_id" = ? LIMIT 1  [["course_id", 15]]
SELECT "categories".* FROM "categories" INNER JOIN "course_categories" ON "categories"."id" = "course_categories"."category_id" WHERE "course_categories"."course_id" = ?  [["course_id", 15]]