app/views/layouts/_navbar.html.erb

          <ul class="dropdown-menu">
            <% if user_signed_in? && current_user.application.present? %>
---
SELECT  "applications".* FROM "applications" WHERE "applications"."user_id" = ? LIMIT 1  [["user_id", 15]]